//#include <stdio.h>
//#include <string.h>
//
////직원
//struct employee {
//	int number; //사번
//	char name[20]; //이름
//	int age; //나이
//	char tell[20]; //전화번호
//};
//
//int main() {
//
//	struct employee e[10] = { //직원 구조체 배열 e 선언
//		{ 1, "홍길동", 20, "111-1111" },
//		{ 2, "강감찬", 25, "111-1112" },
//		{ 3, "이기동", 60, "111-1113" },
//		{ 4, "권김율", 40, "111-1114" },
//		{ 5, "아리랑", 50, "111-1115" },
//		{ 6, "사나이", 45, "111-1116" },
//		{ 7, "이리안", 32, "111-1117" },
//		{ 8, "아리아", 23, "111-1118" },
//		{ 9, "홍길순", 29, "111-1119" },
//		{ 10, "감놔라", 62, "111-1120" } };
//
//	int i;
//	for (i = 0; i < 10; i++)
//		if (e[i].age >= 20 && e[i].age <= 30) //나이가 20 이상 30 이하인 경우
//			printf("%s\n", e[i].name); //이름 출력
//
//	return 0;
//}